# 数据规整：聚合合并重塑

In [1]:
import pandas as pd

In [4]:
import numpy as np

In [8]:
data=pd.Series(np.random.randn(9),
              index=[['a','a','a','b','b','c','c','d','d'],[1,2,3,1,3,1,2,2,3]]
              )

In [9]:
data

a  1    1.152048
   2   -1.621713
   3   -0.860668
b  1    0.192783
   3    0.210354
c  1    0.236944
   2   -1.286891
d  2    0.090201
   3   -1.190440
dtype: float64

In [10]:
data1=pd.Series(np.random.randn(9),
              index=[['a','b','c','d','e','f','g','h','d'],[1,2,3,1,3,1,2,2,3]]
              )

In [11]:
data1

a  1    1.820377
b  2    0.381299
c  3   -1.436848
d  1    0.443657
e  3   -0.424882
f  1   -0.307527
g  2    1.934069
h  2    1.738510
d  3   -0.679668
dtype: float64

In [12]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 2, 0, 1, 1, 2]])

In [13]:
data['b':'d']

b  1    0.192783
   3    0.210354
c  1    0.236944
   2   -1.286891
d  2    0.090201
   3   -1.190440
dtype: float64

In [17]:
data.loc[['b','d']]

b  1    0.192783
   3    0.210354
d  2    0.090201
   3   -1.190440
dtype: float64

In [22]:
data.loc['b':'c',1]

b  1    0.192783
c  1    0.236944
dtype: float64

In [23]:
data

a  1    1.152048
   2   -1.621713
   3   -0.860668
b  1    0.192783
   3    0.210354
c  1    0.236944
   2   -1.286891
d  2    0.090201
   3   -1.190440
dtype: float64

In [24]:
data.unstack()

          1         2         3
a  1.152048 -1.621713 -0.860668
b  0.192783       NaN  0.210354
c  0.236944 -1.286891       NaN
d       NaN  0.090201 -1.190440

In [29]:
frame=pd.DataFrame(np.arange(12).reshape(4,3),
                  index=[['a','a','b','b'],[1,2,1,2]],
                  columns=[['Ohio','Ohio','Colorado'],['Green','Red','Green']])

In [37]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [31]:
frame.index

MultiIndex(levels=[['a', 'b'], [1, 2]],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [33]:
frame.index.names=['key1','key2']

In [36]:
frame.columns.names=['state','color']

In [43]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [46]:
pd.MultiIndex.from_arrays([['Ohio','Ohio','Colorado'],['Green','Red','Green']],names=['state','color'])

MultiIndex(levels=[['Colorado', 'Ohio'], ['Green', 'Red']],
           codes=[[1, 1, 0], [0, 1, 0]],
           names=['state', 'color'])

In [49]:
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [50]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [54]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [56]:
frame.sum(level=0)

state  Ohio     Colorado
color Green Red    Green
key1
a         3   5        7
b        15  17       19

In [57]:
frame.sum(level=1,axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [58]:
frame=pd.DataFrame({'a':range(7),
                   'b':range(7,0,-1),
                   'c':['one','one','one','two','two','two','two'],
                   'd':[1,1,2,0,1,2,3]})

In [59]:
frame

   a  b    c  d
0  0  7  one  1
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [60]:
frame.set_index(['c','d'], drop=False)

       a  b    c  d
c   d
one 1  0  7  one  1
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [61]:
frame2=frame.set_index(['c','d'])

In [62]:
frame2

       a  b
c   d
one 1  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [63]:
frame2.reset_index()

     c  d  a  b
0  one  1  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1